# Selecting Rows Based on Conditionals

In [2]:
import pandas as pd

url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

df = pd.read_csv(url)
df.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [3]:
df[df['Sex']=='male'].head(2)

                                  Name PClass    Age   Sex  Survived  SexCode
2  Allison, Mr Hudson Joshua Creighton    1st  30.00  male         0        0
4        Allison, Master Hudson Trevor    1st   0.92  male         1        0

In [7]:
df[(df['Sex']=='male') & (df['Survived']==1)].head(3)

                             Name PClass    Age   Sex  Survived  SexCode
4   Allison, Master Hudson Trevor    1st   0.92  male         1        0
5              Anderson, Mr Harry    1st  47.00  male         1        0
13       Barkworth, Mr Algernon H    1st    NaN  male         1        0